In [1]:
#importing libraries
import numpy as np
import pandas as pd
import numpy as np

In [2]:
#importing datasets
df = pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df.fillna({
    "experience":"zero"
},inplace=True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
'''df["experience"] = df["experience"].replace({
    np.NaN:"zero",
    np.NaN:"zero"
})'''

'df["experience"] = df["experience"].replace({\n    np.NaN:"zero",\n    np.NaN:"zero"\n})'

In [6]:
median_value = df["test_score(out of 10)"].median()
median_value

8.0

In [7]:
df["test_score(out of 10)"] = df["test_score(out of 10)"].fillna(median_value)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [8]:
'''from word2number import w2n
w2n.word_to_num()'''

'from word2number import w2n\nw2n.word_to_num()'

In [9]:
df['experience'] = df['experience'].replace({
    "zero":0,
    "two":2,
    "three":3,
    "five":5,
    "seven":7,
    "ten":10,
    "eleven":11
})

In [10]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [11]:
#Extracting Dependent and Independent variables
x = df[["experience","test_score(out of 10)","interview_score(out of 10)"]]
y = df["salary($)"]

In [12]:
x

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    8.0                           7
7          11                    7.0                           8

In [13]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [14]:
#training the datasets
from sklearn.linear_model import LinearRegression
lin_reg = LinearRegression()
lin_reg.fit(x,y)

LinearRegression()

In [15]:
#accuracy
lin_reg.score(x,y)

0.961678000257796

In [16]:
#predicted salary($) of a candidate with 2 years experience,9 test score and 6 interview score
lin_reg.predict([[2,9,6]])

C:\Users\Tanvir Ahmed\.conda\envs\dl\lib\site-packages\sklearn\base.py:451: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  "X does not have valid feature names, but"

array([53205.96797671])

In [17]:
#predicted salary($) of a candidate with 12 years experience,10 test score and 10 interview score
lin_reg.predict([[12,10,10]])

C:\Users\Tanvir Ahmed\.conda\envs\dl\lib\site-packages\sklearn\base.py:451: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  "X does not have valid feature names, but"

array([92002.18340611])